ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_fc.c
/**
 *******************************************************************************
 * @file    tmpm46b_fc.c
 * @brief   This file provides API functions for FC driver.
 * @version V2.0.2.1
 * @date    2015/02/27
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2015 All rights reserved
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "tmpm46b_fc.h"

#if defined(__TMPM46B_FC_H)
/** @addtogroup TX04_Periph_Driver
  * @{
  */

/** @defgroup FC 
  * @brief FC driver modules
  * @{
  */

/** @defgroup FC_Private_Defines
  * @{
  */

#define BASE_ADDR_H                         ((uint32_t)0x00080000)

#define SECBIT_SECBIT_PASSWORD              ((uint32_t)0xA74A9D23)
#define SECBIT_SECBIT_SET                   ((uint32_t)0x00000001)
#define SECBIT_SECBIT_CLEAR                 ((uint32_t)0xFFFFFFFE)

#define SECBIT_SECURITY_MASK                ((uint32_t)0x00000001)
#define SECBIT_DISABLE_FLAG                 ((uint32_t)0x00000000)

#define FLCS_BUSY_MASK                      ((uint32_t)0x00000001)
#define FLCS_BUSY_FLAG                      ((uint32_t)0x00000000)

#define FC_PROTECT_MASK                     ((uint32_t)0x00000001)

#define FC_BLOCK_FLAG                       ((uint32_t)0x00000000)

#define FC_PAGE_FLAG                        ((uint32_t)0x00000000)

#define FC_ABORT_MASK                       ((uint32_t)0x01000000)
#define FC_ABORT_FLAG                       ((uint32_t)0x00000000)

#define FC_SWAP_SIZE_MASK                   ((uint32_t)0x00000700)

#define FC_SWAP_STATE_MASK                  ((uint32_t)0x00000003)

#define FC_SWAP_BIT_VALUE_MASK              ((uint32_t)0x00000001)

#define FC_AREA_CLEAR                       ((uint32_t)0x00000000)
#define FC_AREA_0_SET                       ((uint32_t)0x00000007)
#define FC_AREA_1_SET                       ((uint32_t)0x00000070)
#define FC_AREA_ALL_SET                     ((uint32_t)0x00000077)

#define FC_CR_ABORT_SET                     ((uint32_t)0x00000007)
#define FC_STSCLR_ABORT_CLEAR               ((uint32_t)0x00000007)

#define FLASH_AREA                          ((uint32_t)(FLASH_START_ADDR & 0xFFF00000U))

#define FC_CMD_BC1_ADDR                     ((uint32_t)(0x5E005400))
#define FC_CMD_BC2_ADDR                     ((uint32_t)(0x5E00AA00))
#define FC_CMD_BC3_ADDR                     ((uint32_t)(0x5E000000))

#define FC_CMD_BC1_ADDR_H                   ((uint32_t)(FC_CMD_BC1_ADDR + BASE_ADDR_H))
#define FC_CMD_BC2_ADDR_H                   ((uint32_t)(FC_CMD_BC2_ADDR + BASE_ADDR_H))

#define FC_ERASE_CHIP_OVER_TIME             ((uint32_t)0x005FFFFF)      /* FC_ERASE_CHIP_OVER_TIME > 345ms */

#define FC_ERASE_BLOCK_OVER_TIME            ((uint32_t)0x00CFFFFF)      /* FC_ERASE_BLOCK_OVER_TIME > 920ms */
#define FC_ERASE_PAGE_OVER_TIME             ((uint32_t)0x0016FFFF)      /* FC_ERASE_PAGE_OVER_TIME > 115ms */
#define FC_ERASE_AREA_OVER_TIME             ((uint32_t)0x0016FFFF)
#define FC_WRITE_PAGE_OVER_TIME             ((uint32_t)0x0007FFFF)      /* FC_WRITE_PAGE_OVER_TIME > 30.7ms */
#define FC_SET_PROTECT_STATE_OVER_TIME      ((uint32_t)0x000FFFFF)
#define FC_SWAP_SET_OVER_TIME               ((uint32_t)0x0016FFFF)      /* FC_SWAP_SET_OVER_TIME > 115ms */


#define FC_PBA_ADDR_SHIFT                   4U  /*PBA address shift 4 Bits */

#define FC_SWPSR_BIT_START                  ((uint32_t)0x5E000880)

#define FC_PSR0_MASK                        ((uint32_t)0xFFFFFF00)
#define FC_PSR1_PSR2_MASK                   ((uint32_t)0xFFFF0000)

#define FC_BLOCK_ADDR_MASK                  ((uint32_t)0x001FE000)
#define FC_PAGE_ADDR_MASK                   ((uint32_t)0x001FF000)

#define FC_AREA_1_START_ADDR                ((uint32_t)(FLASH_AREA + 0x00080000UL))
#define FC_PAGE_SIZE                        ((uint32_t)(FLASH_PAGE_SIZE/4U))

typedef struct {
    uint32_t Start_Addr;
    uint32_t End_Addr;
} Block_AddrDef;

Block_AddrDef block_addr[] = {
    {0U, 8U}, {8U, 16U}, {16U, 24U}, {24U, 32U}, {32U, 40U},
    {40U, 48U}, {48U, 56U}, {56U, 64U}, {64U, 72U}, {72U, 80U},
    {80U, 88U}, {88U, 96U}, {96U, 104U}, {104U, 112U}, {112U, 120U},
    {120U, 128U}, {128U, 136U}, {136U, 144U}, {144U, 152U}, {152U, 160U},
    {160U, 168U}, {168U, 176U}, {176U, 184U}, {184U, 192U}, {192U, 200U},
    {200U, 208U}, {208U, 216U}, {216U, 224U}, {224U, 232U}, {232U, 240U},
    {240U, 248U}, {248U, 256U},
};

/** @} */
/* End of group FC_Private_Defines */

/** @defgroup FC_Private_FunctionPrototypes
  * @{
  */
static uint8_t FC_AddrToBlockNum(uint32_t Addr);
static void FC_SetAreaSelection(uint8_t BlockNum);
static void FC_ClearAreaSelection(uint8_t BlockNum);
/** @} */
/* End of group FC_Private_FunctionPrototypes */

/** @defgroup FC_Private_Functions
  * @{
  */

/**
  * @brief  Convert address to block number.
  * @param  Addr
  * @retval BlockNum
   */
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static uint8_t FC_AddrToBlockNum(uint32_t Addr)
{
    uint8_t BlockNum = 0U;
    uint8_t i = 0U;
    uint32_t temp = (Addr - FLASH_START_ADDR) / FLASH_PAGE_SIZE;

    for (i = 0U; i <= FC_BLOCK_MAX; ++i) {
        if ((temp >= block_addr[i].Start_Addr) && (temp < block_addr[i].End_Addr)) {
            BlockNum = i;
            break;
        }
    }

    return BlockNum;
}

/**
  * @brief  Set an area selection bit according to block number.
  * @param  BlockNum
  * @retval None
   */
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static void FC_SetAreaSelection(uint8_t BlockNum)
{
    uint32_t tmp = 0U;
    tmp = TSB_FC->AREASEL;
    if (BlockNum <= 15U) {
        tmp |= FC_AREA_0_SET;
    } else if (BlockNum <= 31U) {
        tmp |= FC_AREA_1_SET;
    } else {
        /* Do nothing */
    }
    TSB_FC->AREASEL = tmp;
    while (TSB_FC->AREASEL != tmp) {
        /* Do nothing */
    }
}

/**
  * @brief  Clear an area selection bit according to block number.
  * @param  BlockNum
  * @retval None
   */
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
static void FC_ClearAreaSelection(uint8_t BlockNum)
{
    uint32_t tmp = 0U;
    tmp = TSB_FC->AREASEL;
    if (BlockNum <= 15U) {
        tmp &= ~FC_AREA_0_SET;
    } else if (BlockNum <= 31U) {
        tmp &= ~FC_AREA_1_SET;
    } else {
        /* Do nothing */
    }
    TSB_FC->AREASEL = tmp;
    while (TSB_FC->AREASEL != tmp) {
        /* Do nothing */
    }
}

/** @} */
/* End of group FC_Private_Functions */

/** @defgroup FC_Exported_Functions
  * @{
  */

/**
  * @brief  Set the value of SECBIT register.
  * @param  NewState: The value of SECBIT register.
  *   This parameter can be one of the following values:
  *   DISABLE or ENABLE.
  * @retval None.
  * @register The used register:
  *   FCSECBIT <SECBIT>
  */
void FC_SetSecurityBit(FunctionalState NewState)
{
    uint32_t tmp = TSB_FC->SECBIT;
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set FCSECBIT<SECBIT> to "1" that enable security function  */
        tmp |= SECBIT_SECBIT_SET;
    } else {
        /* Set FCSECBIT<SECBIT> to "0" that disable security function  */
        tmp &= SECBIT_SECBIT_CLEAR;
    }
    TSB_FC->SECBIT = SECBIT_SECBIT_PASSWORD;
    TSB_FC->SECBIT = tmp;
}

/**
  * @brief  Get the value of SECBIT register.
  * @param  None.
  * @retval DISABLE or ENABLE.
  * @register The used register:
  *   FCSECBIT <SECBIT>
  */
FunctionalState FC_GetSecurityBit(void)
{
    uint32_t tmp = 0U;
    FunctionalState retval = ENABLE;

    tmp = TSB_FC->SECBIT & SECBIT_SECURITY_MASK;

    /* Check disable flag */
    if (tmp == SECBIT_DISABLE_FLAG) {
        retval = DISABLE;
    } else {                    /* Check enable flag */
        retval = ENABLE;
    }

    return retval;
}

/**
  * @brief  Get the status of the flash auto operation.
  * @param  None.
  * @retval BUSY or DONE.
  * @register The used register:
  *   FCPSR0<RDY_BSY>
  */
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
WorkState FC_GetBusyState(void)
{
    uint32_t tmp = 0U;
    WorkState retval = DONE;

    tmp = TSB_FC->PSR0 & FLCS_BUSY_MASK;

    /* Check busy flag */
    if (tmp == FLCS_BUSY_FLAG) {
        retval = BUSY;
    } else {                    /* Check ready flag */
        retval = DONE;
    }

    return retval;
}

/**
  * @brief  Get the specified block protection state.
  * @param  BlockNum: The flash block number.
  *   This parameter can be one of the following values:
  *   FC_BLOCK_1 to FC_BLOCK_31
  * @retval DISABLE or ENABLE.
  * @register The used registers:
  *   FCPSR0<31:17>
  *   FCPSR1<31:16>
  *   FCPSR2<31:16>
  */
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
FunctionalState FC_GetBlockProtectState(uint8_t BlockNum)
{
    uint32_t tmp = FC_PROTECT_MASK;
    FunctionalState retval = ENABLE;

    /* Check the parameters */
    assert_param(IS_FC_BLOCK_NUM(BlockNum));
    if (BlockNum <= FC_BLOCK_15) {
        tmp = tmp << ((uint32_t) BlockNum + 16U);
        tmp &= TSB_FC->PSR0;
    } else {
        tmp = tmp << BlockNum;
        tmp &= TSB_FC->PSR1;
    }
    if (tmp == FC_BLOCK_FLAG) {
        /* Return protection status of each block */
        retval = DISABLE;
    } else {
        retval = ENABLE;
    }

    return retval;
}

/**
  * @brief  Get the specified page protection state.
  * @param  PageNum: The flash page number.
  *   This parameter can be one of the following values:
  *   FC_PAGE_0 to FC_PAGE_7
  * @retval DISABLE or ENABLE.
  * @register The used register:
  *   FCPSR0<15:8>
  */
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
FunctionalState FC_GetPageProtectState(uint8_t PageNum)
{
    uint32_t tmp = FC_PROTECT_MASK;
    FunctionalState retval = ENABLE;

    /* Check the parameters */
    assert_param(IS_FC_PAGE_NUM(PageNum));
    tmp = tmp << ((uint32_t) PageNum + 8U);
    tmp &= TSB_FC->PSR0;

    if (tmp == FC_PAGE_FLAG) {
        /* Return protection status of each block */
        retval = DISABLE;
    } else {
        retval = ENABLE;
    }

    return retval;
}

/**
  * @brief  Get the status of the auto operation is aborted or not.
  * @param  None.
  * @retval DISABLE or ENABLE.
  *   DISABLE: Aborted is disable.
  *   ENABLE: Aborted is enable.
  * @register The used register:
  *   FCSR<WEABORT>
  */
FunctionalState FC_GetAbortState(void)
{
    uint32_t tmp = 0U;
    FunctionalState retval = DISABLE;

