ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_fc.c
    tmp = TSB_FC->SR & FC_ABORT_MASK;

    /* Check  flag */
    if (tmp == FC_ABORT_FLAG) {
        retval = DISABLE;
    } else {                    /* Check flag */
        retval = ENABLE;
    }

    return retval;
}

/**
  * @brief  Get the swap size.
  * @param  None.
  * @retval the swap size.
  *   The value returned can be one of the following values:
  *   FC_SWAP_SIZE_4K, FC_SWAP_SIZE_8K, FC_SWAP_SIZE_16K,
  *   FC_SWAP_SIZE_32K, FC_SWAP_SIZE_512K
  * @register The used register:
  *   FCSWPSR <SIZE[2:0]>
  */
uint32_t FC_GetSwapSize(void)
{
    uint32_t tmp = 0U;

    tmp = TSB_FC->SWPSR & FC_SWAP_SIZE_MASK;
    tmp = (tmp >> 8U);

    return tmp;
}

/**
  * @brief  Get the swap state.
  * @param  None.
  * @retval the swap state.
  *   The value returned can be one of the following values:
  *   FC_SWAP_RELEASE, FC_SWAP_PROHIBIT,
  *   FC_SWAPPING, FC_SWAP_INITIAL.
  * @register The used register:
  *   FCSWPSR <SWP[1:0]>
  */
uint32_t FC_GetSwapState(void)
{
    uint32_t tmp = 0U;

    tmp = TSB_FC->SWPSR & FC_SWAP_STATE_MASK;

    return tmp;
}

/**
  * @brief  Specifies an "area" in the Flash memory that is targeted by Flash memory 
  *  operation command.
  * @param  AreaNum: the flash area number.
  *   This parameter can be one of the following values:
  *   FC_AREA_0, FC_AREA_1, FC_AREA_ALL.
  * @param  NewState: Specify area state.
  *   This parameter can be one of the following values:
  *   ENABLE:Select the area.
  *   DISABLE:Unselect the area.
  * @retval None
  * @register The used register:
  *   FCAREASEL <AREA0><AREA1>
  */
void FC_SelectArea(uint8_t AreaNum, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FC_AREA(AreaNum));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    switch (AreaNum) {
    case FC_AREA_0:
        (NewState == ENABLE) ? (TSB_FC->AREASEL |= FC_AREA_0_SET) : (TSB_FC->AREASEL &=
                                                                     ~FC_AREA_0_SET);
        break;
    case FC_AREA_1:
        (NewState == ENABLE) ? (TSB_FC->AREASEL |= FC_AREA_1_SET) : (TSB_FC->AREASEL &=
                                                                     ~FC_AREA_1_SET);
        break;
    case FC_AREA_ALL:
        (NewState == ENABLE) ? (TSB_FC->AREASEL |= FC_AREA_ALL_SET) : (TSB_FC->AREASEL &=
                                                                       ~FC_AREA_ALL_SET);
        break;
    default:
        /* Do nothing */
        break;
    }
}

/**
  * @brief  Set abortion of auto operation command
  * @param  None
  * @retval None
  * @register The used register:
  *   FCCR <WEABORT>
  */
void FC_SetAbortion(void)
{
    /* Set abortion of auto operation command */
    TSB_FC->CR |= FC_CR_ABORT_SET;
}

/**
  * @brief  Clear FCSR<WEABORT> to "0" command
  * @param  None
  * @retval None
  * @register The used register:
  *   FCSTSCLR <WEABORT>
  */
void FC_ClearAbortion(void)
{
    /* Clear FCSR<WEABORT> to "0" command */
    TSB_FC->STSCLR |= FC_STSCLR_ABORT_CLEAR;
}

/**
  * @brief  Set Frequency division ratio to change the clock (WCLK: fsys/(DIV+1))
  *  in automatic operation to 8 to 12MHz
  * @param  ClkDiv: the divisor of the system clock.
  *   the parameter is can be one of the following values:
  *   FC_Clk_Div_1, FC_Clk_Div_2, FC_Clk_Div_3, FC_Clk_Div_4, 
  *   FC_Clk_Div_5, FC_Clk_Div_6, FC_Clk_Div_7, FC_Clk_Div_8, 
  *   FC_Clk_Div_9, FC_Clk_Div_10, FC_Clk_Div_11, FC_Clk_Div_12, 
  *   FC_Clk_Div_13, FC_Clk_Div_14, FC_Clk_Div_15, FC_Clk_Div_16,
  *   FC_Clk_Div_17, FC_Clk_Div_18, FC_Clk_Div_19, FC_Clk_Div_20, 
  *   FC_Clk_Div_21, FC_Clk_Div_22, FC_Clk_Div_23, FC_Clk_Div_24, 
  *   FC_Clk_Div_25, FC_Clk_Div_26, FC_Clk_Div_27, FC_Clk_Div_28, 
  *   FC_Clk_Div_29, FC_Clk_Div_30, FC_Clk_Div_31, FC_Clk_Div_32.
  * @retval None
  * @register The used register:
  *   FCWCLKCR <DIV>
  */
void FC_SetClkDiv(uint8_t ClkDiv)
{
    /* Check the parameters */
    assert_param(IS_FC_WCLK_DIV(ClkDiv));

    TSB_FC->WCLKCR = (uint32_t) ClkDiv;
}

/**
  * @brief  Set the number of counts that makes a programming time (CNT/WCLK) by automatic program
  *  execution command be within the range of 20 to 40 micro-sec.
  * @param  ProgramCount: the counter of the divided system clock for flash program
  *   This parameter can be one of the following values:
  *   FC_PROG_CNT_250, FC_PROG_CNT_300, FC_PROG_CNT_350.
  * @retval None
  * @register The used register:
  *   FCPROGCR <CNT>
  */
void FC_SetProgramCount(uint8_t ProgramCount)
{
    /* Check the parameters */
    assert_param(IS_FC_PROG_CNT(ProgramCount));

    TSB_FC->PROGCR = (uint32_t) ProgramCount;
}

/**
  * @brief  Set the number of counts until erase time (CNT/WCLK) will be 100 ~ 130msec 
  *  using each auto erase command
  * @param  EraseCounter: the counter of the divided system clock for flash program
  *   This parameter can be one of the following values:
  *   FC_ERAS_CNT_85, FC_ERAS_CNT_90, FC_ERAS_CNT_95, FC_ERAS_CNT_100, 
  *   FC_ERAS_CNT_105, FC_ERAS_CNT_110, FC_ERAS_CNT_115, FC_ERAS_CNT_120, 
  *   FC_ERAS_CNT_125, FC_ERAS_CNT_130, FC_ERAS_CNT_135, FC_ERAS_CNT_140.
  * @retval None
  * @register The used register:
  *   FCERASECR <CNT>
  */
void FC_SetEraseCounter(uint8_t EraseCounter)
{
    /* Check the parameters */
    assert_param(IS_FC_ERASE_CNT(EraseCounter));

    TSB_FC->ERASECR = (uint32_t) EraseCounter;
}

/**
  * @brief  Program the protection bit to make the specified block protected.
  * @param  BlockNum: The flash block number.
  *   This parameter can be one of the following values:
  *   FC_BLOCK_1 to FC_BLOCK_31
  * @retval FC_SUCCESS, FC_ERROR_PROTECTED, FC_ERROR_OVER_TIME.
  * @register The used registers:
  *   FCPSR0<31:17>
  *   FCPSR1<31:16>
  *   FCPSR2<31:16>
  */
FC_Result FC_ProgramBlockProtectState(uint8_t BlockNum)
{
    FC_Result retval = FC_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    volatile uint32_t *PBA;
    uint32_t counter = FC_SET_PROTECT_STATE_OVER_TIME;
    volatile uint32_t PBA_data;

    /* Check the parameters */
    assert_param(IS_FC_BLOCK_NUM(BlockNum));

