ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_fc.c
    PBA_data = ((uint32_t) BlockNum + 7U) << FC_PBA_ADDR_SHIFT;

    PBA_data += (uint32_t) 0x5E000000;
    PBA = (uint32_t *) PBA_data;

    if (ENABLE == FC_GetBlockProtectState(BlockNum)) {
        retval = FC_ERROR_PROTECTED;
    } else {
        TSB_FC->AREASEL |= FC_AREA_ALL_SET;
        while (TSB_FC->AREASEL != FC_AREA_ALL_SET) {
            /* Do nothing */
        }
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 1 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 2 */
        *addr1 = (uint32_t) 0x0000009A; /* bus cycle 3 */
        *PBA = (uint32_t) 0x0000009A;   /* bus cycle 4 */
        __DSB();

        while (BUSY == FC_GetBusyState()) {     /* check if FLASH is busy with overtime counter */
            if (!(counter--)) { /* check overtime */
                retval = FC_ERROR_OVER_TIME;
                break;
            } else {
                /* Do nothing */
            }
        }
        TSB_FC->AREASEL &= ~FC_AREA_ALL_SET;
        while (TSB_FC->AREASEL != FC_AREA_CLEAR) {
            /* Do nothing */
        }
    }

    return retval;
}

/**
  * @brief  Program the protection bit to make the specified page protected.
  * @param  PageNum: The flash page number.
  *   This parameter can be one of the following values:
  *   FC_PAGE_0 to FC_PAGE_7
  * @retval FC_SUCCESS, FC_ERROR_PROTECTED, FC_ERROR_OVER_TIME.
  * @register The used register:
  *   FCPSR0<15:8>
  */
FC_Result FC_ProgramPageProtectState(uint8_t PageNum)
{
    FC_Result retval = FC_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    volatile uint32_t *PBA = 0U;
    uint32_t counter = FC_SET_PROTECT_STATE_OVER_TIME;
    volatile uint32_t PBA_data;

    /* Check the parameters */
    assert_param(IS_FC_PAGE_NUM(PageNum));

    PBA_data = (uint32_t) PageNum << FC_PBA_ADDR_SHIFT;

    PBA_data += (uint32_t) 0x5E000000;
    PBA = (uint32_t *) PBA_data;

    if (ENABLE == FC_GetPageProtectState(PageNum)) {
        retval = FC_ERROR_PROTECTED;
    } else {
        TSB_FC->AREASEL |= FC_AREA_ALL_SET;
        while (TSB_FC->AREASEL != FC_AREA_ALL_SET) {
            /* Do nothing */
        }
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 1 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 2 */
        *addr1 = (uint32_t) 0x0000009A; /* bus cycle 3 */
        *PBA = (uint32_t) 0x0000009A;   /* bus cycle 4 */
        __DSB();

        while (BUSY == FC_GetBusyState()) {     /* check if FLASH is busy with overtime counter */
            if (!(counter--)) { /* check overtime */
                retval = FC_ERROR_OVER_TIME;
                break;
            } else {
                /* Do nothing */
            }
        }
        TSB_FC->AREASEL &= ~FC_AREA_ALL_SET;
        while (TSB_FC->AREASEL != FC_AREA_CLEAR) {
            /* Do nothing */
        }
    }

    return retval;
}

/**
  * @brief  Erase the protection bits to make the whole flash unprotected.
  * @param  None   
  * @retval FC_SUCCESS, FC_ERROR_OVER_TIME.
  * @register The used registers:
  *   FCPSR0<15:8><31:17>
  *   FCPSR1<31:16>
  */
FC_Result FC_EraseProtectState(void)
{
    FC_Result retval = FC_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    volatile uint32_t *addr3 = (uint32_t *) FC_CMD_BC3_ADDR;
    uint32_t counter = FC_SET_PROTECT_STATE_OVER_TIME;

    TSB_FC->AREASEL |= FC_AREA_ALL_SET;
    while (TSB_FC->AREASEL != FC_AREA_ALL_SET) {
        /* Do nothing */
    }
    *addr1 = (uint32_t) 0x000000AA;     /* bus cycle 1 */
    *addr2 = (uint32_t) 0x00000055;     /* bus cycle 2 */
    *addr1 = (uint32_t) 0x0000006A;     /* bus cycle 3 */
    *addr3 = (uint32_t) 0x0000006A;     /* bus cycle 4 */
    __DSB();

    while (BUSY == FC_GetBusyState()) { /* check if FLASH is busy with overtime counter */
        if (!(counter--)) {     /* check overtime */
            retval = FC_ERROR_OVER_TIME;
            break;
        } else {
            /* Do nothing */
        }
    }
    TSB_FC->AREASEL &= ~FC_AREA_ALL_SET;
    while (TSB_FC->AREASEL != FC_AREA_CLEAR) {
        /* Do nothing */
    }

    return retval;
}

/**
  * @brief  Write data to the specified page.
  * @param  PageAddr: The page start address.
  * @param  Data: The pointer to data buffer to be written into the page.
  *   The data size should be FC_PAGE_SIZE.
  * @retval FC_SUCCESS, FC_ERROR_PROTECTED, FC_ERROR_OVER_TIME.
  * @register The used register:
  *   None
  */
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
FC_Result FC_WritePage(uint32_t PageAddr, uint32_t * Data)
{
    uint32_t tmpAddr = 0U;
    uint32_t i = 0U;
    uint32_t *source = Data;
    uint8_t BlockNum = 0U;
    volatile uint8_t PageNum = 0U;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    volatile uint32_t *PA = 0U;
    uint32_t counter = FC_WRITE_PAGE_OVER_TIME;
    FC_Result retval = FC_SUCCESS;
    FunctionalState state1 = DISABLE;
    FunctionalState state2 = DISABLE;

    BlockNum = FC_AddrToBlockNum(PageAddr);

    tmpAddr = (PageAddr & (uint32_t) 0x00FFFFF8) | (uint32_t) 0x5E000000;
    PA = (uint32_t *) tmpAddr;

    assert_param(IS_FC_PAGE_ADDR(PageAddr));
    assert_param(IS_POINTER_NOT_NULL(Data));

    if (BlockNum >= FC_BLOCK_16) {
        addr1 = (uint32_t *) FC_CMD_BC1_ADDR_H;
        addr2 = (uint32_t *) FC_CMD_BC2_ADDR_H;
    } else {
        /* Do nothing */
    }
    if (BlockNum == 0U) {
        PageNum = (uint8_t) ((PageAddr - FLASH_START_ADDR) / FLASH_PAGE_SIZE);
        state1 = FC_GetPageProtectState(PageNum);
    } else {
        state2 = FC_GetBlockProtectState(BlockNum);
    }
    if ((ENABLE == state1) || (ENABLE == state2)) {
        retval = FC_ERROR_PROTECTED;
    } else {
        FC_SetAreaSelection(BlockNum);
        /* page program */
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 1 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 2 */
        *addr1 = (uint32_t) 0x000000A0; /* bus cycle 3 */
        for (i = 0U; i < PROGRAM_UNIT; i++) {
            *PA = *source;
            source++;
        }
        __DSB();

        while (BUSY == FC_GetBusyState()) {     /* check if FLASH is busy with overtime counter */
            if (!(counter--)) { /* check overtime */
                retval = FC_ERROR_OVER_TIME;
                break;
            } else {
                /* Do nothing */
            }
        }
        FC_ClearAreaSelection(BlockNum);
    }

    return retval;
}

/**
  * @brief  Erase the contents of the specified block.
  * @param  BlockAddr: The block start address.
  * @retval FC_SUCCESS, FC_ERROR_PROTECTED, FC_ERROR_OVER_TIME.
  * @register The used register:
  *   None
  */
#if defined ( __GNUC__ )    /* GCC Compiler */
__attribute__((section(".ram_func")))
#endif
FC_Result FC_EraseBlock(uint32_t BlockAddr)
{
    FC_Result retval = FC_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    volatile uint32_t *BA = 0U;
    uint32_t counter = FC_ERASE_BLOCK_OVER_TIME;
    uint8_t BlockNum = 0U;
    FunctionalState state1 = DISABLE;

