ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_fc.c
    BlockNum = FC_AddrToBlockNum(BlockAddr);

    assert_param(IS_FC_ADDR(BlockAddr));

    if (BlockNum >= FC_BLOCK_16) {
        addr1 = (uint32_t *) FC_CMD_BC1_ADDR_H;
        addr2 = (uint32_t *) FC_CMD_BC2_ADDR_H;
    } else {
        /* Do nothing */
    }
    BlockAddr &= FC_BLOCK_ADDR_MASK;
    BlockAddr |= (uint32_t) 0x5E000000;

    BA = (uint32_t *) BlockAddr;
    if (BlockNum >= FC_BLOCK_1) {
        state1 = FC_GetBlockProtectState(BlockNum);
    } else {
        state1 = FC_GetPageProtectState(FC_PAGE_0);
        state1 |= FC_GetPageProtectState(FC_PAGE_1);
        state1 |= FC_GetPageProtectState(FC_PAGE_2);
        state1 |= FC_GetPageProtectState(FC_PAGE_3);
        state1 |= FC_GetPageProtectState(FC_PAGE_4);
        state1 |= FC_GetPageProtectState(FC_PAGE_5);
        state1 |= FC_GetPageProtectState(FC_PAGE_6);
        state1 |= FC_GetPageProtectState(FC_PAGE_7);
    }
    if (ENABLE == state1) {
        retval = FC_ERROR_PROTECTED;
    } else {
        FC_SetAreaSelection(BlockNum);
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 1 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 2 */
        *addr1 = (uint32_t) 0x00000080; /* bus cycle 3 */
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 4 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 5 */
        *BA = (uint32_t) 0x00000030;    /* bus cycle 6 */
        __DSB();

        while (BUSY == FC_GetBusyState()) {     /* check if FLASH is busy with overtime counter */
            if (!(counter--)) { /* check overtime */
                retval = FC_ERROR_OVER_TIME;
                break;
            } else {
                /* Do nothing */
            }
        }
        FC_ClearAreaSelection(BlockNum);
    }

    return retval;
}

/**
  * @brief  Erase the contents of the specified area.
  * @param  AreaAddr: The area start address.
  * @retval FC_SUCCESS, FC_ERROR_PROTECTED, FC_ERROR_OVER_TIME.
  * @register The used register:
  *   None
  */
FC_Result FC_EraseArea(uint32_t AreaAddr)
{
    FC_Result retval = FC_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    volatile uint32_t *AA = 0U;
    uint32_t tmp = 0U;
    uint8_t BlockNum = 0U;
    uint32_t counter = FC_ERASE_AREA_OVER_TIME;
    BlockNum = FC_AddrToBlockNum(AreaAddr);

    assert_param(IS_FC_ADDR(AreaAddr)); /* Check whether it is in the flash address range */

    if (BlockNum >= FC_BLOCK_16) {
        addr1 = (uint32_t *) FC_CMD_BC1_ADDR_H;
        addr2 = (uint32_t *) FC_CMD_BC2_ADDR_H;
    } else {
        /* Do nothing */
    }

    if (BlockNum < FC_BLOCK_16) {
        AA = (uint32_t *) 0x5E000000;
        tmp = TSB_FC->PSR0;
        tmp &= FC_PSR0_MASK;
    } else {
        AA = (uint32_t *) (FC_AREA_1_START_ADDR | (uint32_t) 0x5E000000);
        tmp = TSB_FC->PSR1;
        tmp &= FC_PSR1_PSR2_MASK;
    }

    if (tmp) {
        retval = FC_ERROR_PROTECTED;
    } else {
        FC_SetAreaSelection(BlockNum);
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 1 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 2 */
        *addr1 = (uint32_t) 0x00000080; /* bus cycle 3 */
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 4 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 5 */
        *AA = (uint32_t) 0x00000020;    /* bus cycle 6 */
        __DSB();

        while (BUSY == FC_GetBusyState()) {     /* check if FLASH is busy with overtime counter */
            if (!(counter--)) { /* check overtime */
                retval = FC_ERROR_OVER_TIME;
                break;
            } else {
                /* Do nothing */
            }
        }
        FC_ClearAreaSelection(BlockNum);
    }

    return retval;
}

/**
  * @brief  Erase the contents of the specified page.
  * @param  PageAddr: The page start address.
  * @retval FC_SUCCESS, FC_ERROR_PROTECTED, FC_ERROR_OVER_TIME.
  * @register The used register:
  *   None
  */
FC_Result FC_ErasePage(uint32_t PageAddr)
{
    FC_Result retval = FC_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    volatile uint32_t *PGA = 0U;
    uint32_t counter = FC_ERASE_PAGE_OVER_TIME;
    uint8_t BlockNum = 0U;
    uint8_t PageNum = 0U;
    FunctionalState state1 = DISABLE;
    FunctionalState state2 = DISABLE;
    BlockNum = FC_AddrToBlockNum(PageAddr);

    assert_param(IS_FC_PAGE_ADDR(PageAddr));

    if (BlockNum >= FC_BLOCK_16) {
        addr1 = (uint32_t *) FC_CMD_BC1_ADDR_H;
        addr2 = (uint32_t *) FC_CMD_BC2_ADDR_H;
    } else {
        /* Do nothing */
    }

    PageAddr &= FC_PAGE_ADDR_MASK;
    PageAddr |= (uint32_t) 0x5E000000;

    PGA = (uint32_t *) PageAddr;
    PageNum = (uint8_t) ((PageAddr - FLASH_START_ADDR) / FLASH_PAGE_SIZE);
    if (BlockNum == 0U) {
        state1 = FC_GetPageProtectState(PageNum);
    } else {
        state2 = FC_GetBlockProtectState(BlockNum);
    }
    if ((ENABLE == state1) || (ENABLE == state2)) {
        retval = FC_ERROR_PROTECTED;
    } else {
        FC_SetAreaSelection(BlockNum);
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 1 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 2 */
        *addr1 = (uint32_t) 0x00000080; /* bus cycle 3 */
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 4 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 5 */
        *PGA = (uint32_t) 0x00000040;   /* bus cycle 6 */
        __DSB();

        while (BUSY == FC_GetBusyState()) {     /* check if FLASH is busy with overtime counter */
            if (!(counter--)) { /* check overtime */
                retval = FC_ERROR_OVER_TIME;
                break;
            } else {
                /* Do nothing */
            }
        }
        FC_ClearAreaSelection(BlockNum);
    }

    return retval;
}

/**
  * @brief  Erase the contents of the entire chip.
  * @param  None.
  * @retval FC_SUCCESS, FC_ERROR_PROTECTED, FC_ERROR_OVER_TIME.
  * @register The used register:
  *   None
  */
FC_Result FC_EraseChip(void)
{
    FC_Result retval = FC_SUCCESS;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    uint32_t counter = FC_ERASE_CHIP_OVER_TIME;
    FunctionalState result;
    uint8_t PageNum = FC_PAGE_0;
    uint8_t BlockNum = FC_BLOCK_1;
    for (PageNum = FC_PAGE_0; PageNum <= FC_PAGE_MAX; ++PageNum) {
        result = FC_GetPageProtectState(PageNum);
        if (result == ENABLE) {
            break;
        } else {
            /* Do nothing */
        }
    }

    for (BlockNum = FC_BLOCK_1; BlockNum <= FC_BLOCK_MAX; ++BlockNum) {
        if (result == ENABLE) {
            break;
        } else {
            result = FC_GetBlockProtectState(BlockNum);
        }
    }

    if (ENABLE == result) {
        retval = FC_ERROR_PROTECTED;
    } else {
        TSB_FC->AREASEL |= FC_AREA_ALL_SET;
        while (TSB_FC->AREASEL != FC_AREA_ALL_SET) {
            /* Do nothing */
        }
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 1 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 2 */
        *addr1 = (uint32_t) 0x00000080; /* bus cycle 3 */
        *addr1 = (uint32_t) 0x000000AA; /* bus cycle 4 */
        *addr2 = (uint32_t) 0x00000055; /* bus cycle 5 */
        *addr1 = (uint32_t) 0x00000010; /* bus cycle 6 */
        __DSB();

        while (BUSY == FC_GetBusyState()) {     /* check if FLASH is busy with overtime counter */
            if (!(counter--)) { /* check overtime */
                retval = FC_ERROR_OVER_TIME;
                break;
            } else {
                /* Do nothing */
            }
        }
        TSB_FC->AREASEL &= ~FC_AREA_ALL_SET;
        while (TSB_FC->AREASEL != FC_AREA_CLEAR) {
            /* Do nothing */
        }
    }

    return retval;
}

/**
  * @brief  Setting values of FCSWPSR[10:0] by memory swap command.
  * @param  BitNum: The FCSWPSR bit number to be set.
  *   This parameter can be one of the following values:
  *   FC_SWPSR_BIT_0 to FC_SWPSR_BIT_10
  * @retval FC_SUCCESS, FC_ERROR_OVER_TIME.
  * @register The used register:
  *   FCSWPSR<SIZE><FLG><SWP>
  */
FC_Result FC_SetSwpsrBit(uint8_t BitNum)
{
    FC_Result retval = FC_SUCCESS;
    uint32_t counter = FC_SWAP_SET_OVER_TIME;
    volatile uint32_t *addr1 = (uint32_t *) FC_CMD_BC1_ADDR;
    volatile uint32_t *addr2 = (uint32_t *) FC_CMD_BC2_ADDR;
    volatile uint32_t *MSA = 0U;
    uint32_t MSA_data;

    /* Check the parameters */
    assert_param(IS_FC_SWPSR_BIT_NUM(BitNum));

