ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_fc.c
    MSA_data = (uint32_t) BitNum << FC_PBA_ADDR_SHIFT;
    MSA_data += FC_SWPSR_BIT_START;
    MSA = (uint32_t *) MSA_data;

    TSB_FC->AREASEL |= FC_AREA_ALL_SET;
    while (TSB_FC->AREASEL != FC_AREA_ALL_SET) {
        /* Do nothing */
    }
    *addr1 = (uint32_t) 0x000000AA;     /* bus cycle 1 */
    *addr2 = (uint32_t) 0x00000055;     /* bus cycle 2 */
    *addr1 = (uint32_t) 0x0000009A;     /* bus cycle 3 */
    *MSA = (uint32_t) 0x0000009A;       /* bus cycle 4 */
    __DSB();
    while (BUSY == FC_GetBusyState()) { /* check if FLASH is busy with overtime counter */
        if (!(counter--)) {     /* check overtime */
            retval = FC_ERROR_OVER_TIME;
            break;
        } else {
            /* Do nothing */
        }
    }
    TSB_FC->AREASEL &= ~FC_AREA_ALL_SET;
    while (TSB_FC->AREASEL != FC_AREA_CLEAR) {
        /* Do nothing */
    }

    return retval;
}

/**
* @brief  Get the value of the special bit of FCSWPSR[10:0].
  * @param  BitNum: The special bit of SWPSR.
  *   This parameter can be one of the following values:
  *   FC_SWPSR_BIT_0 to FC_SWPSR_BIT_10.
  * @retval The value of the special bit.
  *   The value returned can be one of the following values:
  *   FC_BIT_VALUE_0, FC_BIT_VALUE_1.
  * @register The used register:
  *   FCSWPSR<SIZE><FLG><SWP>
  */
uint32_t FC_GetSwpsrBitValue(uint8_t BitNum)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_FC_SWPSR_BIT_NUM(BitNum));

    tmp = TSB_FC->SWPSR;
    tmp = (tmp >> (uint32_t) BitNum);
    tmp &= FC_SWAP_BIT_VALUE_MASK;

    return tmp;
}

/** @} */
/* End of group FC_Exported_Functions */

/** @} */
/* End of group FC */

/** @} */
/* End of group TX04_Periph_Driver */

#endif                          /*(__TMPM46B_FC_H) */
